app/views/tags/index.html.erb

<script type="text/javascript">
  $(".select_all").click(function () {
    var should_check = $(this).attr("checked") == 'checked';
    $(".select_tag").attr('checked', should_check);
  });
---
SELECT `tags`.* FROM `tags`