app/views/posts/index.html.erb

SELECT `posts`.* FROM `posts`
SELECT `tags`.* FROM `tags`
---
<script type="text/javascript">
  $('.post').each(function(){
    var id = this.id;
    $.ajax({
      url: "posts/"+id+".json",
      success: function(p){
        for (var tag in p["tags"]){
          $("#"+p.id+" .button."+tag).text(p["tags"][tag]);
        }
      }
    });
  });