app/controllers/calc_controller.rb

  def rebuild # params: {:tags :array}
    puts params
    begin
      tags = params[:tags]
      all_categories = []
      tags.each{|tag| all_categories << [tag, "not_"+tag]}
---
SELECT `tags`.* FROM `tags`