app/controllers/posts_controller.rb

SELECT `tags`.* FROM `tags`
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` LIMIT 30 OFFSET 0
---
  def index
    @tags = Tag.all
    @posts = Post.paginate(:page => params[:page], :per_page => 30)