app/controllers/tags_controller.rb

  def index
    @@redis_prior = get_prior if @@redis_prior.nil?
    @@redis_tags = get_tag_list if @@redis_tags.nil?

    @redis_prior = @@redis_prior
    @redis_tags = @@redis_tags
    tags = Tag.joins("left join priors on priors.tag_id = tags.tag_id").joins("left join precises on precises.tag_id = tags.tag_id").select("tags.*, priors.prior, precises.precise, precises.recall, precises.true_positive, precises.false_positive, precises.true_negative, precises.false_negative, precises.test_volume, precises.updated_at")

    @tags = []
    tags.each do |tag|
---
SELECT `prior`.* FROM `prior`
SELECT `tags`.* FROM `tags`